In [1]:
import pandas as pd
import numpy as np
import sqlalchemy
from sqlalchemy import create_engine,MetaData, Table

### Export the country club data from PHPMyAdmin, and connect to a local SQLite instance from Jupyter notebook for the following questions.

In [2]:
engine = create_engine('mysql://root:Password@127.0.0.1/country_club')

In [3]:
print(engine.table_names())

['Bookings', 'Facilities', 'Members']

In [4]:
metadata = MetaData()

In [5]:
Members = Table('Members',metadata, autoload=True, autoload_with=engine)

In [6]:
print(repr(Members))

Table('Members', MetaData(bind=None), Column('memid', INTEGER(), table=<Members>, primary_key=True, nullable=False, server_default=DefaultClause(<sqlalchemy.sql.elements.TextClause object at 0x7fedae234940>, for_update=False)), Column('surname', VARCHAR(length=17), table=<Members>), Column('firstname', VARCHAR(length=9), table=<Members>), Column('address', VARCHAR(length=39), table=<Members>), Column('zipcode', INTEGER(), table=<Members>), Column('telephone', VARCHAR(length=14), table=<Members>), Column('recommendedby', VARCHAR(length=2), table=<Members>), Column('joindate', VARCHAR(length=19), table=<Members>), schema=None)

In [7]:
print(Members.columns.keys())

['memid', 'surname', 'firstname', 'address', 'zipcode', 'telephone', 'recommendedby', 'joindate']

In [8]:
connection = engine.connect()

### Q10: Produce a list of facilities with a total revenue less than 1000.
The output of facility name and total revenue, sorted by revenue. Remember
that there's a different cost for guests and members!

In [9]:
query10 = """SELECT DISTINCT(f.name) as FacilityName, sum(CASE 
            WHEN b.memid >0 THEN f.membercost * b.slots
            WHEN b.memid =0 THEN f.guestcost * b.slots
            END) AS TotalRevenue
            FROM `Facilities` AS f
            LEFT JOIN Bookings AS b ON f.facid = b.facid
GROUP BY f.name
HAVING TotalRevenue < 1000
ORDER BY TotalRevenue """

In [10]:
ans10 = pd.DataFrame(connection.execute(query10).fetchall())
ans10 = ans10.rename(columns={0:'Facility Name', 1:'Total Revenue'})
ans10

   Facility Name Total Revenue
0   Table Tennis         180.0
1  Snooker Table         240.0
2     Pool Table         270.0

### Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [11]:
query11 = """SELECT concat_ws(' ', m1.surname, m1.firstname) as MemberName, 
concat_ws(' ', m2.surname, m2.firstname) as Recommended_By from  Members as m1 
LEFT JOIN Members as m2 on m1.recommendedby = m2.memid where m1.recommendedby >=1 
order by m2.surname, m2.firstname"""

In [12]:
ans11 = pd.DataFrame(connection.execute(query11).fetchall())
ans11 = ans11.rename(columns={0:'Member Name', 1:'Recommended By'})
ans11

                Member Name     Recommended By
0          Sarwin Ramnaresh     Bader Florence
1               Coplin Joan      Baker Timothy
2           Genting Matthew     Butters Gerald
3             Baker Timothy     Farrell Jemima
4              Pinker David     Farrell Jemima
5          Rumney Henrietta    Genting Matthew
6             Jones Douglas        Jones David
7                Dare Nancy    Joplette Janice
8               Jones David    Joplette Janice
9                 Hunt John  Purview Millicent
10               Boothe Tim         Rownam Tim
11          Joplette Janice       Smith Darren
12           Butters Gerald       Smith Darren
13             Owen Charles       Smith Darren
14               Smith Jack       Smith Darren
15           Mackenzie Anna       Smith Darren
16  Worthington-Smyth Henry        Smith Tracy
17        Purview Millicent        Smith Tracy
18            Crumpet Erica        Smith Tracy
19               Baker Anne    Stibbons Ponder
20           Bader Florence    Stibbons Ponder
21          Stibbons Ponder       Tracy Burton

### Q12: Find the facilities with their usage by member, but not guests

In [13]:
query12 = """SELECT f.name as FacilityName, concat_ws(' ',m.surname, m.firstname) as Member,
sec_to_time(sum(b.slots)*1800) as TimeUsed from Bookings as b 
LEFT JOIN Facilities as f on b.facid = f.facid 
LEFT JOIN Members as m on b.memid = m.memid 
WHERE b.memid >= 1 group by b.memid, b.facid order by m.surname"""

In [14]:
ans12 = pd.DataFrame(connection.execute(query12).fetchall())
ans12 = ans12.rename(columns={0:'Facility Name',1:'Surname FirstName',2:'Facility Used(in Hours)'})
ans12

       Facility Name        Surname FirstName Facility Used(in Hours)
0    Badminton Court           Bader Florence         0 days 13:30:00
1         Pool Table           Bader Florence         0 days 11:30:00
2       Table Tennis           Bader Florence         1 days 19:00:00
3      Snooker Table           Bader Florence         1 days 09:00:00
4     Tennis Court 2           Bader Florence         0 days 12:00:00
..               ...                      ...                     ...
197   Massage Room 1      Tupperware Hyacinth         0 days 01:00:00
198  Badminton Court  Worthington-Smyth Henry         0 days 07:30:00
199       Pool Table  Worthington-Smyth Henry         0 days 18:30:00
200     Table Tennis  Worthington-Smyth Henry         0 days 03:00:00
201   Massage Room 1  Worthington-Smyth Henry         0 days 01:00:00

[202 rows x 3 columns]

### Q13: Find the facilities usage by month, but not guests

In [15]:
query13 = """SELECT f.name AS FacilityName, 
concat_ws(' ', m.surname,m.firstname) AS MemberName,
SUBSTR(b.starttime,6,2) AS Month, 
sec_to_time(sum(slots)*1800) AS TimeUsed 
FROM Bookings AS b 
LEFT JOIN Facilities AS f ON b.facid = f.facid
LEFT JOIN Members AS m ON b.memid = m.memid
WHERE b.memid >=1
GROUP BY f.name, MemberName, b.starttime,b.slots
ORDER BY Month"""

In [16]:
ans13 = pd.DataFrame(connection.execute(query13).fetchall())
ans13 = ans13.rename(columns={0:'Facility Name',1:'Member',2:'Month',3:'Time Used'})
ans13

       Facility Name                   Member Month Time Used
0       Table Tennis             Smith Darren    07  01:00:00
1     Massage Room 1             Smith Darren    07  01:00:00
2      Snooker Table             Smith Darren    07  01:00:00
3         Pool Table             Smith Darren    07  00:30:00
4         Pool Table             Smith Darren    07  00:30:00
...              ...                      ...   ...       ...
3155      Pool Table  Worthington-Smyth Henry    09  01:00:00
3156      Pool Table  Worthington-Smyth Henry    09  00:30:00
3157      Pool Table           Mackenzie Anna    09  00:30:00
3158      Pool Table            Baker Timothy    09  00:30:00
3159      Pool Table  Worthington-Smyth Henry    09  00:30:00

[3160 rows x 4 columns]